src/master_batch/simpleFoam_files/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     simpleFoam;

startFrom       latestTime;
startTime       0;

stopAt          endTime;
endTime         3000;
deltaT          1;

writeControl    timeStep;
writeInterval   60;
purgeWrite      0;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
