src/master_batch/simpleFoam_files/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // Pressure: GAMG, standard for steady SIMPLE
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    // Velocity + turbulence (works for both k-ω and k-ε)
    "(U|k|omega|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }
}

SIMPLE
{
    // Convergence criteria
    // -> Initial residuals consistently ≤ 1e-3 over several iterations
    residualControl
    {
        U                       1e-4;
        p                       1e-4;
        "(k|omega|epsilon)"     1e-4;
    }

    // Urban snappyHex mesh: at least one non-orthogonal corrector
    nNonOrthogonalCorrectors    1;

    // Reference pressure (incompressible)
    pRefCell        0;
    pRefValue       0;
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U                       0.3;
        "(k|omega|epsilon).*"   0.3;
    }
}

// ************************************************************************* //
