src/master_batch/simpleFoam_files/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

f18p1_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

f18p1_cup_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

f18p2_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

f18p2_cup_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

f18p3_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

f18p3_cup_main.stl
{
    extractionMethod extractFromSurface;
    includedAngle 150;
    writeObj yes;
}

// ************************************************************************* //
